<a href="https://colab.research.google.com/github/Priyal-Y/Machine-Learning-and-Data-Science/blob/main/Linear_Regression_(NumPY%2C__Pandas_).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [16]:
import pandas as pd
import numpy as np

In [9]:
df = pd.read_csv('/content/Levels_Fyi_Salary_Data.csv')
print(df)

                timestamp     company     level  ... Race_Hispanic  Race Education
0        06-07-2017 11:33      Oracle        L3  ...             0   NaN       NaN
1        06-10-2017 17:11        eBay      SE 2  ...             0   NaN       NaN
2        06-11-2017 14:53      Amazon        L7  ...             0   NaN       NaN
3       6/17/2017 0:23:14       Apple        M1  ...             0   NaN       NaN
4      6/20/2017 10:58:51   Microsoft        60  ...             0   NaN       NaN
...                   ...         ...       ...  ...           ...   ...       ...
62637    09-09-2018 11:52      Google        T4  ...             0   NaN       NaN
62638   9/13/2018 8:23:32   Microsoft        62  ...             0   NaN       NaN
62639  9/13/2018 14:35:59        MSFT        63  ...             0   NaN       NaN
62640  9/16/2018 16:10:35  Salesforce  Lead MTS  ...             0   NaN       NaN
62641   1/29/2019 5:12:59       apple      ict3  ...             0   NaN       NaN

[62642 rows x 29 columns]

In [10]:
print(df.columns)

Index(['timestamp', 'company', 'level', 'title', 'totalyearlycompensation',
       'location', 'yearsofexperience', 'yearsatcompany', 'tag', 'basesalary',
       'stockgrantvalue', 'bonus', 'gender', 'otherdetails', 'cityid', 'dmaid',
       'rowNumber', 'Masters_Degree', 'Bachelors_Degree', 'Doctorate_Degree',
       'Highschool', 'Some_College', 'Race_Asian', 'Race_White',
       'Race_Two_Or_More', 'Race_Black', 'Race_Hispanic', 'Race', 'Education'],
      dtype='object')

In [11]:
salaryDF = df[['company','totalyearlycompensation','yearsofexperience','yearsatcompany','basesalary']]

In [12]:
print(salaryDF.head())

     company  totalyearlycompensation  ...  yearsatcompany  basesalary
0     Oracle                   127000  ...             1.5      107000
1       eBay                   100000  ...             3.0           0
2     Amazon                   310000  ...             0.0      155000
3      Apple                   372000  ...             5.0      157000
4  Microsoft                   157000  ...             3.0           0

[5 rows x 5 columns]

##**Create training and testing data**

y = totalyearlycompensation

x1 = yearsofexperience
x2 = yearsatcompany
x3 = basesalary

y = w1x1 + w2x2 + w3x3 + b

Y =WX

X.T = (x1 x2 x3 1)
W.T = (w1 w2 w3 b)

In [25]:
x_train = salaryDF.iloc[:50000,2:]
y_train = salaryDF.iloc[:50000,1]
x_test = salaryDF.iloc[50000:,2:]
y_test = salaryDF.iloc[50000:,1]
x_train.assign(b=1)
x_test.assign(b=1)

       yearsofexperience  yearsatcompany  basesalary  b
50000                6.0             4.0      147000  1
50001                2.0             1.0       88000  1
50002                4.0             0.0      118000  1
50003                3.0             1.0      112000  1
50004                4.0             0.0      145000  1
...                  ...             ...         ... ..
62637               10.0             1.0      155000  1
62638                2.0             2.0      146900  1
62639               14.0            12.0      157000  1
62640                8.0             4.0      194688  1
62641                0.0             0.0      155000  1

[12642 rows x 4 columns]

***Functions for RMSE & calculating weights***

In [26]:
def rmse(targets, predictions):
  return np.sqrt((np.square(predictions - targets)).mean())

def calculateWeights(x_train, y_train):
  w = np.linalg.inv(np.transpose(x_train).dot(x_train)).dot(np.transpose(x_train).dot(y_train))
  return w

In [27]:
w = calculateWeights(x_train, y_train)
print(x_train.shape)

(50000, 3)

In [28]:
#training error
y_train_pred = x_train.dot(w)
train_error = rmse(y_train, y_train_pred)
print(train_error)

#testing error
y_test_pred = x_test.dot(w)
test_error = rmse(y_test, y_test_pred)
print(test_error)

92627.74547700818
120276.76730360147

In [33]:
'''
y = totalyearlycompensation
x1 = yearsofexperience  x2 = yearsatcompany  x3 = basesalary
'''
new_pred = np.array([5,3,80000]).dot(w)
print(new_pred)

129373.78264826829